test/bench/evidence/20260718-0233-1a6598374/f_write_nj4-linux-r1.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.301462] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=write rw=write bs=1M nj=4 fsync=0 size=1G
P9CASE write
p9write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.39
Starting 4 threads
p9write: Laying out IO file (1 file / 1024MiB)
Jobs: 4 (f=4)
p9write: (groupid=0, jobs=1): err= 0: pid=100: Sat Jul 18 02:34:11 2026
  write: IOPS=695, BW=696MiB/s (729MB/s)(1024MiB/1472msec); 0 zone resets
    clat (usec): min=43, max=6471, avg=386.12, stdev=800.04
     lat (usec): min=52, max=6489, avg=405.35, stdev=808.26
    clat percentiles (usec):
     |  1.00th=[   44],  5.00th=[   45], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   51], 40.00th=[   53], 50.00th=[   56], 60.00th=[   60],
     | 70.00th=[   70], 80.00th=[  269], 90.00th=[ 1418], 95.00th=[ 2147],
     | 99.00th=[ 3884], 99.50th=[ 4228], 99.90th=[ 5604], 99.95th=[ 6456],
     | 99.99th=[ 6456]
  lat (usec)   : 50=28.91%, 100=47.17%, 250=2.64%, 500=4.10%, 750=0.29%
  lat (usec)   : 1000=0.68%
  lat (msec)   : 2=8.59%, 4=6.84%, 10=0.78%
  cpu          : usr=0.27%, sys=6.73%, ctx=458, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=101: Sat Jul 18 02:34:11 2026
  write: IOPS=697, BW=698MiB/s (731MB/s)(1024MiB/1468msec); 0 zone resets
    clat (usec): min=43, max=5521, avg=377.81, stdev=752.51
     lat (usec): min=52, max=5537, avg=399.98, stdev=771.14
    clat percentiles (usec):
     |  1.00th=[   44],  5.00th=[   45], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   49], 40.00th=[   53], 50.00th=[   55], 60.00th=[   61],
     | 70.00th=[   75], 80.00th=[  269], 90.00th=[ 1401], 95.00th=[ 2147],
     | 99.00th=[ 3130], 99.50th=[ 3851], 99.90th=[ 5407], 99.95th=[ 5538],
     | 99.99th=[ 5538]
  lat (usec)   : 50=32.03%, 100=43.07%, 250=3.03%, 500=4.39%, 750=0.10%
  lat (usec)   : 1000=1.07%
  lat (msec)   : 2=8.89%, 4=7.13%, 10=0.29%
  cpu          : usr=0.61%, sys=6.34%, ctx=465, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=102: Sat Jul 18 02:34:11 2026
  write: IOPS=697, BW=698MiB/s (731MB/s)(1024MiB/1468msec); 0 zone resets
    clat (usec): min=43, max=6252, avg=368.75, stdev=737.52
     lat (usec): min=52, max=7229, avg=400.03, stdev=798.26
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   45], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   49], 40.00th=[   53], 50.00th=[   56], 60.00th=[   60],
     | 70.00th=[   75], 80.00th=[  265], 90.00th=[ 1418], 95.00th=[ 2114],
     | 99.00th=[ 3195], 99.50th=[ 3818], 99.90th=[ 4359], 99.95th=[ 6259],
     | 99.99th=[ 6259]
  lat (usec)   : 50=31.74%, 100=43.65%, 250=3.12%, 500=4.69%, 750=0.20%
  lat (usec)   : 1000=0.78%
  lat (msec)   : 2=8.50%, 4=6.93%, 10=0.39%
  cpu          : usr=0.89%, sys=6.20%, ctx=461, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=103: Sat Jul 18 02:34:11 2026
  write: IOPS=697, BW=697MiB/s (731MB/s)(1024MiB/1469msec); 0 zone resets
    clat (usec): min=43, max=4198, avg=373.54, stdev=717.44
     lat (usec): min=52, max=4221, avg=395.96, stdev=742.32
    clat percentiles (usec):
     |  1.00th=[   44],  5.00th=[   45], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   48], 40.00th=[   53], 50.00th=[   55], 60.00th=[   60],
     | 70.00th=[   73], 80.00th=[  269], 90.00th=[ 1532], 95.00th=[ 2147],
     | 99.00th=[ 3032], 99.50th=[ 3195], 99.90th=[ 4080], 99.95th=[ 4228],
     | 99.99th=[ 4228]
  lat (usec)   : 50=32.32%, 100=43.55%, 250=2.25%, 500=4.39%, 750=0.20%
  lat (usec)   : 1000=0.98%
  lat (msec)   : 2=8.89%, 4=7.23%, 10=0.20%
  cpu          : usr=0.54%, sys=6.68%, ctx=451, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2783MiB/s (2918MB/s), 696MiB/s-698MiB/s (729MB/s-731MB/s), io=4096MiB (4295MB), run=1468-1472msec
P9DONE write
P9ALLDONE
[    2.667621] reboot: Power down