test/bench/evidence/20260718-0233-1a6598374/f_write_nj4-linux-r2.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.299717] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=write rw=write bs=1M nj=4 fsync=0 size=1G
P9CASE write
p9write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.39
Starting 4 threads
p9write: Laying out IO file (1 file / 1024MiB)
Jobs: 4 (f=4)
p9write: (groupid=0, jobs=1): err= 0: pid=100: Sat Jul 18 02:35:30 2026
  write: IOPS=502, BW=502MiB/s (527MB/s)(1024MiB/2038msec); 0 zone resets
    clat (usec): min=44, max=4346, avg=386.20, stdev=745.13
     lat (usec): min=53, max=4372, avg=409.08, stdev=766.89
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   46], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   47], 40.00th=[   53], 50.00th=[   56], 60.00th=[   62],
     | 70.00th=[   77], 80.00th=[  269], 90.00th=[ 1450], 95.00th=[ 2147],
     | 99.00th=[ 3163], 99.50th=[ 3392], 99.90th=[ 4293], 99.95th=[ 4359],
     | 99.99th=[ 4359]
  lat (usec)   : 50=36.43%, 100=38.38%, 250=2.54%, 500=4.79%, 750=0.10%
  lat (usec)   : 1000=0.59%
  lat (msec)   : 2=9.38%, 4=7.42%, 10=0.39%
  cpu          : usr=0.29%, sys=4.91%, ctx=475, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=101: Sat Jul 18 02:35:30 2026
  write: IOPS=502, BW=503MiB/s (527MB/s)(1024MiB/2036msec); 0 zone resets
    clat (usec): min=44, max=6089, avg=379.99, stdev=741.85
     lat (usec): min=54, max=6101, avg=402.95, stdev=764.65
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   46], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   47], 40.00th=[   53], 50.00th=[   57], 60.00th=[   63],
     | 70.00th=[   77], 80.00th=[  265], 90.00th=[ 1434], 95.00th=[ 2114],
     | 99.00th=[ 3097], 99.50th=[ 3785], 99.90th=[ 4293], 99.95th=[ 6063],
     | 99.99th=[ 6063]
  lat (usec)   : 50=34.28%, 100=39.75%, 250=3.52%, 500=4.69%, 750=0.10%
  lat (usec)   : 1000=1.37%
  lat (msec)   : 2=9.18%, 4=6.64%, 10=0.49%
  cpu          : usr=0.39%, sys=4.86%, ctx=476, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=102: Sat Jul 18 02:35:30 2026
  write: IOPS=502, BW=503MiB/s (527MB/s)(1024MiB/2036msec); 0 zone resets
    clat (usec): min=44, max=4811, avg=379.88, stdev=726.81
     lat (usec): min=54, max=4825, avg=405.59, stdev=765.42
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   46], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   48], 40.00th=[   53], 50.00th=[   56], 60.00th=[   63],
     | 70.00th=[   77], 80.00th=[  269], 90.00th=[ 1582], 95.00th=[ 2114],
     | 99.00th=[ 2999], 99.50th=[ 3556], 99.90th=[ 4293], 99.95th=[ 4817],
     | 99.99th=[ 4817]
  lat (usec)   : 50=34.77%, 100=39.16%, 250=3.71%, 500=4.79%, 1000=0.39%
  lat (msec)   : 2=9.67%, 4=7.13%, 10=0.39%
  cpu          : usr=0.64%, sys=4.52%, ctx=469, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=103: Sat Jul 18 02:35:30 2026
  write: IOPS=503, BW=503MiB/s (528MB/s)(1024MiB/2034msec); 0 zone resets
    clat (usec): min=44, max=5797, avg=385.58, stdev=754.62
     lat (usec): min=53, max=5808, avg=404.94, stdev=776.00
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   46], 10.00th=[   46], 20.00th=[   46],
     | 30.00th=[   49], 40.00th=[   53], 50.00th=[   56], 60.00th=[   62],
     | 70.00th=[   76], 80.00th=[  265], 90.00th=[ 1500], 95.00th=[ 2147],
     | 99.00th=[ 3163], 99.50th=[ 3687], 99.90th=[ 5080], 99.95th=[ 5800],
     | 99.99th=[ 5800]
  lat (usec)   : 50=34.77%, 100=38.96%, 250=4.69%, 500=3.81%, 1000=0.98%
  lat (msec)   : 2=8.79%, 4=7.71%, 10=0.29%
  cpu          : usr=0.25%, sys=4.72%, ctx=465, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2010MiB/s (2107MB/s), 502MiB/s-503MiB/s (527MB/s-528MB/s), io=4096MiB (4295MB), run=2034-2038msec
P9DONE write
P9ALLDONE
[    3.135962] reboot: Power down